export const TARIFF_ALL_INCLUDED = `
<b>Тариф “Все и сразу” 👩‍🏫</b>

🌟 <b>В состав входит:</b>
🎓 Бессрочный доступ ко всем материалам курса
🛠️ Пошаговая стратегия запуска речи
📝 5 тестов для оценки речевого развития
🎥 Более 30 видео по ключевым направлениям речевого развития ребенка
🧩 Более 150 практических заданий для ежедневной самостоятельной работы
🖥️ 4 вебинара с возможностью задать вопросы и получить разбор
📚 Конспекты и другие дополнительные материалы
💡 Комфортный формат получения информации
🤖 Доступ к рассылочному чат-боту

✨ <b>Только для данного тарифа:</b>
📩 Регулярная обратная связь от куратора и автора курса
❓ Возможность получить ответы по всем возникающим вопросам
🎯 Персональные рекомендации по выполнению практических заданий
🎁 Творческий речевой подарок от команды по окончанию курса

🏦 Доступна рассрочка от банка (проценты по рассрочке платим мы)
`;

export const TARIFF_I_AM = `
<b>Тариф “Я сама” 👩‍🏫</b>

🌟 <b>В состав входит:</b>
🎓 Бессрочный доступ ко всем материалам курса
🛠️ Пошаговая стратегия запуска речи
📝 5 тестов для оценки речевого развития
🎥 Более 30 видео по ключевым направлениям речевого развития ребенка
🧩 Более 150 практических заданий для ежедневной самостоятельной работы
🖥️ 4 живых вебинара
📚 Конспекты и другие дополнительные материалы
💡 Комфортный формат получения информации
🤖 Доступ к рассылочному чат-боту

🏦 Доступна рассрочка от банка (проценты по рассрочке платим мы)
`;

export const TEXT_START =
    "<b>«От звука к слову» - интенсив, который запустит речь вашего малыша!</b>\n" +
    "\n" +
    "Вы ждёте слов и предложений ребёнка, но они так и не появляются? Устали от противоречивых советов и вечного «подождите, заговорит»? Не ждите – помогите малышу говорить осознанно и правильно уже сейчас! 💬\n" +
    "\n" +
    "🔹 <b>Для кого этот интенсив?</b>\n" +
    "\n" +
    "✔️ Родителей детей от 1 до 3,5 лет 👶\n" +
    "✔️ Тех, кто переживает из-за задержки речи и не хочет «просто ждать» ⏳\n" +
    "✔️ Кто устал от бесконечных истерик не говорящего малыша 😫\n" +
    "✔️ Кого запутала куча советов из интернета 🌐\n" +
    "✔️ Чьи дети родились раньше срока или в двуязычной семье 🌍\n" +
    "✔️ Кто хочет понять, как правильно развивать речь малыша без ошибок 🧠\n" +
    "\n" +
    "🎯 <b>Что получите на интенсиве?</b>\n" +
    "\n" +
    "✔️ Четкую стратегию запуска речи – без воды, только работающие методы 🛠️\n" +
    "✔️ 5 тестов для диагностики речи – поймёте, на каком этапе есть проблемы у вашего ребенка 📝\n" +
    "✔️ 30+ видеоуроков – структурированная информация о речевом развитии 🎥\n" +
    "✔️ 150+ практических заданий – применяйте сразу, результат не заставит ждать 🧩\n" +
    "✔️ Поддержку куратора и чат для общения (в тарифе «Индивидуальный») 👩‍🏫\n" +
    "✔️ Живые вебинары – вебинары в записи 🖥️\n" +
    "✔️ Удобный формат получения теории и практических заданий с помощью рассылки в чат-боте 🤖\n" +
    "\n" +
    "<b>ВНИМАНИЕ! Акция! 🎁</b>\n" +
    "\n" +
    "❗ Приобретая интенсив, вы получаете бонус, а именно:\n" +
    "🔴 30-минутную диагностику с автором курса для обсуждения проблем малыша и получения персональных рекомендаций.\n"
